Homework 1:

In [2]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)

df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

1.Rename column names using function. "First Name" --> "first_name", "Age" --> "age

In [4]:
df.columns=['first_name', 'age', 'City']
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

2.Print the first 3 rows of the DataFrame

In [ ]:
print(df.head(3))

3.Find the mean age of the individuals

In [ ]:
print("The  mean age of the individuals :",df["age"].mean())

4.Select and print only the 'Name' and 'City' columns

In [5]:
print(df[["first_name","City"]])

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

5.Add a new column 'Salary' with random salary values

In [27]:
import numpy as np

df[ 'Salary']=np.random.randint(1000,8000,size=(df.index.max()+1,1))
df

  first_name  age           City  Salary
0      Alice   25       New York    4766
1        Bob   30  San Francisco    3543
2    Charlie   35    Los Angeles    1057
3      David   40        Chicago    3024

6.Display summary statistics of the DataFrame

In [28]:
df.describe()

             age       Salary
count   4.000000     4.000000
mean   32.500000  3097.500000
std     6.454972  1543.956498
min    25.000000  1057.000000
25%    28.750000  2532.250000
50%    32.500000  3283.500000
75%    36.250000  3848.750000
max    40.000000  4766.000000

Homework 2:

1.Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data. Use below table.

In [29]:
import pandas as pd

data={'Month':['Jan','Feb',"Mar",'Apr'],'Sales':[5000,6000,7500,8000],'Expenses':[3000,3500,4000,4500]}
sales_and_expenses =pd.DataFrame(data)
sales_and_expenses

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

2.Calculate and display the maximum sales and expenses.

In [ ]:
print("The maximun Sales amount:",sales_and_expenses ['Sales'].max())
print("The maximum Expenses amount:",sales_and_expenses ['Expenses'].max())

The maximun Sales amount: 8000
The maximum Expenses amount: 4500

3.Calculate and display the minimum sales and expenses.

In [ ]:
print(sales_and_expenses .agg({'Sales':"min",'Expenses':"min"}))

Sales       5000
Expenses    3000
dtype: int64

In [ ]:
print(sales_and_expenses .agg({'Sales':"mean",'Expenses':"mean"}))

Sales       6625.0
Expenses    3750.0
dtype: float64

Homework 3:

1.Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.

In [1]:
import pandas as pd

data={'Category':['Rent','Utilities','Groceries','Entertainment'],
      'January':[1200,200,300,150],
      'February':[1300,220,320,160],
      'March':[1400,240,330,160],
      'April':[1500,250,350,280]
      }
expenses=pd.DataFrame(data)
expenses

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    160    280

2.Calculate and display the maximum expense for each category.

In [2]:
expenses["Max_Expense"] = expenses.loc[:, "January":"April"].max(axis=1)

print(expenses[["Category", "Max_Expense"]])

        Category  Max_Expense
0           Rent         1500
1      Utilities          250
2      Groceries          350
3  Entertainment          280

3.Calculate and display the minimum expense for each category.

In [3]:
expenses["Min_Expense"] = expenses.loc[:, "January":"April"].min(axis=1)

print(expenses[["Category", "Min_Expense"]])

        Category  Min_Expense
0           Rent         1200
1      Utilities          200
2      Groceries          300
3  Entertainment          150

4.Calculate and display the average expense for each category.

In [4]:
expenses["Mean_Expense"] = expenses.loc[:, "January":"April"].mean(axis=1)

print(expenses[["Category", "Mean_Expense"]])

        Category  Mean_Expense
0           Rent        1350.0
1      Utilities         227.5
2      Groceries         325.0
3  Entertainment         187.5